___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101) #so that the output is the same (pseudo RNG)

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
pd.DataFrame(np.array([[1,2,3],[4,5,6]]),['F','X'],['a','b','c']) #data can be 2D as opposed to Series

   a  b  c
F  1  2  3
X  4  5  6

In [6]:
# pd.Series(np.array([[1,2,3],[4,5,6]]),['F','X']) this is where Series fall short

In [7]:
df['W'] #each column in a dataframe is just a Series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [9]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [10]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [11]:
#we can check as follows
type(df)

pandas.core.frame.DataFrame

In [12]:
type(df['Y'])

pandas.core.series.Series

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df.iloc[0] #to get a specific row (more on this below)

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [16]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [17]:
df[['X','Z']] #if you want a single column, you pass in the column name
#if you want multiple columns, you pass in a list of column names

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [18]:
# SQL Syntax (NOT RECOMMENDED!)
# df.W does the same thing as df['W'] 
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [19]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [20]:
df['new'] = df['W'] + df['Y']

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
df['composite'] = df['W'] + df['X'] + df['Y'] + df['Z']

In [23]:
df['composite']

A    4.746778
B    0.089688
C   -1.338233
D   -0.548357
E    5.459028
Name: composite, dtype: float64

In [24]:
df

          W         X         Y         Z       new  composite
A  2.706850  0.628133  0.907969  0.503826  3.614819   4.746778
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959   0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.489355  -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  -0.548357
E  0.190794  1.978757  2.605967  0.683509  2.796762   5.459028

** Removing Columns**

In [25]:
df.drop('new',axis=1) #need to specify axis=1 because by default axis=0 (i.e. dropping a row)

          W         X         Y         Z  composite
A  2.706850  0.628133  0.907969  0.503826   4.746778
B  0.651118 -0.319318 -0.848077  0.605965   0.089688
C -2.018168  0.740122  0.528813 -0.589001  -1.338233
D  0.188695 -0.758872 -0.933237  0.955057  -0.548357
E  0.190794  1.978757  2.605967  0.683509   5.459028

In [26]:
# Not inplace unless specified! = no changes made to the original df
df

          W         X         Y         Z       new  composite
A  2.706850  0.628133  0.907969  0.503826  3.614819   4.746778
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959   0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.489355  -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  -0.548357
E  0.190794  1.978757  2.605967  0.683509  2.796762   5.459028

In [27]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z  composite
A  2.706850  0.628133  0.907969  0.503826   4.746778
B  0.651118 -0.319318 -0.848077  0.605965   0.089688
C -2.018168  0.740122  0.528813 -0.589001  -1.338233
D  0.188695 -0.758872 -0.933237  0.955057  -0.548357
E  0.190794  1.978757  2.605967  0.683509   5.459028

In [29]:
df.drop('composite',axis=1,inplace=True)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [31]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.shape

(5, 4)

** Selecting Rows**

In [34]:
df.loc['A'] #loc takes in a label

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [35]:
type(df.loc['A']) #both columns and rows of a pandas df are pandas Series

pandas.core.series.Series

In [36]:
df.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

Or select based off of position instead of label

In [37]:
df.iloc[2] #iloc takes in an index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [38]:
df.iloc[4]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

** Selecting subset of rows and columns **

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df.loc['B','Y']

-0.8480769834036315

In [41]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [42]:
df.iloc[1,2] #same as doing df.loc['B','Y']

-0.8480769834036315

In [43]:
df.iloc[[0,1],[0,2]] #same as doing df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df>0 #gives us a dataframe back but with Boolean values

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [46]:
booldf = df>0

In [47]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
df[df>0] #similar to conditional selection in numpy arrays
#it is however more common to pass in a row or column value

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [51]:
df[df['W']>0] #such as in this example
#essentially a conditional selection returns a subset of a dataframe which is also a dataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
type(df[df['W']>0])

pandas.core.frame.DataFrame

In [53]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [54]:
type(df[df['W']>0]['Y'])

pandas.core.series.Series

In [55]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [59]:
df[df['W']>0][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [60]:
df[df['W']>0].loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [61]:
df[df['Y']>1]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [62]:
df[(df['W']>0) & (df['Y'] > 1)] #cannot use "and" and "or" when dealing with ambiguous truth series
#use either ampersand & or pipe |

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [65]:
df[df['Y']<0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [66]:
df[(df['W']<0) | (df['Y']<0)] #parantheses are important okay !

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [67]:
df[(df['W']<0) & (df['Y']<0)] #this should return an empty dataframe

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [68]:
df[(df['W']<0) & (df['Y']<0)]['W'] #this should return an empty series

Series([], Name: W, dtype: float64)

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
# Reset to default 0,1...n index
df.reset_index() #like many operations in df it doesnt occur inplace
#where you would do df.reset_index(inplace=True)
#makes the current index, a new column in the DataFrame

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [71]:
newind = 'CA NY WY OR CO'.split()

In [72]:
df['States'] = newind

In [73]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [74]:
df.set_index('States') #neat trick to set our index to whatever we want

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [75]:
df #this change is not inplace unless we do df.set_index('States',inplace=True)

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [76]:
df.set_index('States',inplace=True)

In [77]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [78]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) #this creates a list of tuples of pairs between outside and inside lists
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [79]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [80]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df
#2 outside levels G1,G2 each having 3 inside levels 1,2,3

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [81]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [82]:
type(df.loc['G1']) #using the outside index, we get a DataFrame

pandas.core.frame.DataFrame

In [83]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [84]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [85]:
type(df.loc['G1'].loc[1]) #further using the inside index, gives us a Series

pandas.core.series.Series

In [86]:
df.index.names

FrozenList([None, None])

In [87]:
df.index.names = ['Group','Num']

In [88]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [89]:
df.loc['G2'].loc[2]['B'] #grabbing a particular value from this multi-index DataFrame

0.07295967531703869

In [90]:
df.xs('G1') #alternative to df.loc['G1']
#xs stands for cross section
#allows us to jump inside quicker

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [91]:
df.xs(['G1',1])

/var/folders/yl/rrfnp6k51zv1pcvy34mgtqpr0000gp/T/ipykernel_1598/580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [92]:
df.xs(1,level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

# Great Job!